archive/before-2018-11-10/2017-06-28-docker网络访问.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-01 Mon 21:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>docker网络访问</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Peng Xie" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">docker网络访问</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org66232d8">1. 安装docker</a>
<ul>
<li><a href="#org41aaf42">1.1. Mac</a></li>
<li><a href="#orge3c06ac">1.2. ubuntu</a></li>
</ul>
</li>
<li><a href="#org1ea6da8">2. 如何访问docker中的容器</a></li>
<li><a href="#orge3f5a3b">3. <span class="todo TODO">TODO</span> Mac上使用</a></li>
</ul>
</div>
</div>

<div id="outline-container-org66232d8" class="outline-2">
<h2 id="org66232d8"><span class="section-number-2">1</span> 安装docker</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org41aaf42" class="outline-3">
<h3 id="org41aaf42"><span class="section-number-3">1.1</span> Mac</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Mac上可以去 <a href="https://www.docker.com/">官网</a> 上下载一个docker.img文件，然后直接安装就可以了。启
动后，命令行下自动就会有docker命令。
</p>
</div>
</div>

<div id="outline-container-orge3c06ac" class="outline-3">
<h3 id="orge3c06ac"><span class="section-number-3">1.2</span> ubuntu</h3>
<div class="outline-text-3" id="text-1-2">
<p>
ubuntu14.04上，docekr的安装包名字不叫docker，而是叫 <code>docker.io</code> 。
所以需要这样安装：
</p>
<div class="org-src-container">
<pre class="src src-sh">     sudo apt-get install -susdo  docker.io
</pre>
</div>

<p>
安装好后，需要把当前用户加入docker组内：
</p>
<div class="org-src-container">
<pre class="src src-sh">     sudo usermod -a -G docker &lt;username&gt;
</pre>
</div>

<p>
重新登陆后，启动docker服务即可：
</p>
<div class="org-src-container">
<pre class="src src-sh">      sudo service docker start
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1ea6da8" class="outline-2">
<h2 id="org1ea6da8"><span class="section-number-2">2</span> 如何访问docker中的容器</h2>
<div class="outline-text-2" id="text-2">
<p>
拉起ras容器很简单：
</p>
<div class="org-src-container">
<pre class="src src-sh">    docker run -d xxx:xxx
</pre>
</div>

<p>
重点是解决如何在“外部”访问容器。也就是网络方面的问题。Mac上通过端
口映射的方式太“原始”。在纯Linux的环境中，可以有更好的选择。
</p>

<p>
Linux下默认docker使用的网络结构如下图所示：
</p>
<pre class="example">
    +------------------------------------------------------------------------+
    |                             Host                                       |
    |                                                                        |
    |     +------------------+                     +------------------+      |
    |     |                  |                     |                  |      |
    |     |                  |                     |                  |      |
    |     |    Container1    |                     |    Container2    |      |
    |     |                  |                     |                  |      |
    |     |    +--------+    |                     |    +--------+    |      |
    |     |    |  eth0  |    |                     |    |  eth0  |    |      |
    |     +----+---+----+----+                     +----+----+---+----+      |
    |              ^  172.17.42.2                            ^  172.17.42.3  |
    |              |                                         |               |
    |              |                                         |               |
    |              |                                         |               |
    |              |                                         |               |
    |              v                                         v               |
    |          +---+-----+                              +----+----+          |
    |          |         |                              |         |          |
    |     +----+ vethXX  +------------------------------+ vethYY  +----+     |
    |     |    |         |                              |         |    |     |
    |     |    +---------+           docker0            +---------+    |     | 
    |     |                       +------------+                       |     |
    |     +-----------------------+  docker0   +-----------------------+     |
    |                             +-----+------+ 172.17.42.1/16              |
    |                                                                        |
    |                       +--------------------------+                     |
    +-----------------------|         eth0             |---------------------+
                            +--------------------------+
                                                 10.10.10.1
</pre>

<p>
默认情况下会新建一个名叫 <code>docker0</code> 的网桥。可以理解为 <code>docker0</code> 就是
Linux在内部使用软件虚拟出了一个交换机。拉起的容器中的 <code>eth0</code> 都通过
特殊的技术(veth pair 可以参考 <a href="2017-01-23-Linux%E7%BD%91%E7%BB%9C%E8%AE%BE%E5%A4%87%E7%9B%B8%E5%85%B3%E7%9A%84%E5%A4%A7%E6%9D%82%E7%83%A9.html#veth">veth</a> )连接在这个交换机上。这样，宿主机
和容器以及容器和容器之间都可以相互通信。如上图所示的，172网段也就是
该宿主机中的虚拟网络。容器中如果需要访问外部10网段，可以通过NAT来实
现。
</p>

<p>
但是这样 会导致宿主机以外的机器不能访问到容器。为了实现“外部”也可以
访问容器。我们可以这样设计：
</p>
<pre class="example">
    +------------------------------------------------------------------------+
    |                             Host                                       |
    |                                                                        |
    |     +------------------+                     +------------------+      |
    |     |                  |                     |                  |      |
    |     |                  |                     |                  |      |
    |     |    Container1    |                     |    Container2    |      |
    |     |                  |                     |                  |      |
    |     |    +--------+    |                     |    +--------+    |      |
    |     |    |  eth0  |    |                     |    |  eth0  |    |      |
    |     +----+---+----+----+                     +----+----+---+----+      |
    |              ^  10.10.10.2                             ^  10.10.10.3   |
    |              |                                         |               |
    |              |                                         |               |
    |              |                                         |               |
    |              |                                         |               |
    |              v                                         v               |
    |          +---+-----+                              +----+----+          |
    |          |         |                              |         |          |
    |     +----+ vethXX  +------------------------------+ vethYY  +----+     |
    |     |    |         |                              |         |    |     |
    |     |    +---------+         bridge-eth0          +---------+    |     | 
    |     |                     +---------------+                      |     |
    |     +---------------------+  bridge-eth0  +----------------------+     |
    |                           +---------------+                            |
    |                                   ^   10.10.10.1                       |
    |                                   |                                    |
    |                                   v                                    |
    |                       +-----------+--------------+                     |
    +-----------------------|         eth0             |---------------------+
                            +--------------------------+                   
</pre>
<ol class="org-ol">
<li>把宿主机上的eth0网卡用的ip地址“移”到网桥上 <code>bridge-eth0</code> 。</li>
<li>设置宿主机中的eth0网卡也连到 <code>bridge-eth0</code> 上。</li>
<li>配置docker服务使用名为 <code>bridge-eth0</code> 的网桥。</li>
</ol>

<p>
下面的脚本接受一个 <code>&lt;interface&gt;</code> 参数。实现如下功能：
</p>
<ol class="org-ol">
<li>新建一个名为 <code>bridge-&lt;interface-name&gt;</code> 的网桥。</li>
<li>把原来 <code>&lt;interface&gt;</code> 的ip地址分配给了 <code>bridge-&lt;interface-name&gt;</code> 。</li>
<li>把原来 <code>&lt;interface&gt;</code> 的连到 <code>bridge-&lt;interface-name&gt;</code> 网桥。</li>
</ol>

<div class="org-src-container">
<pre class="src src-sh">    <span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">!/bin/bash</span>
    moveHostIntf(){
        <span style="color: #ff8700;">IFINDEX</span>=$<span style="color: #ff8700;">1</span>
        <span style="color: #ff8700;">BRIDGE</span>=bridge-$<span style="color: #ff8700;">IFINDEX</span>

        bridge link show|cut -d<span style="color: #ff4ea3;">\ </span> -f 2|grep <span style="color: #ff4ea3;">"^$IFINDEX\$"</span>
        <span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">brctl show $BRIDGE | grep "\&lt;$IFINDEX\&gt;" &gt;/dev/null</span>
        <span style="color: #a1db00;">if</span> [ $<span style="color: #ff8700;">?</span> = 0 ];<span style="color: #a1db00;">then</span>
            <span style="color: #d18aff;">echo</span> <span style="color: #ff4ea3;">"host interface $IFINDEX already in bridge $BRIDGE"</span>
            <span style="color: #a1db00;">return</span> 1
        <span style="color: #a1db00;">fi</span>

        <span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">save route table related to this interface</span>
        <span style="color: #ff8700;">myRoute</span>=$(ip route show scope global dev $<span style="color: #ff8700;">IFINDEX</span> | <span style="color: #a1db00;">while </span><span style="color: #d18aff;">read</span> dst via gw;<span style="color: #a1db00;">do if</span> [ <span style="color: #ff4ea3;">"$via"</span> = <span style="color: #ff4ea3;">"via"</span> ]; <span style="color: #a1db00;">then </span><span style="color: #d18aff;">echo</span> <span style="color: #ff4ea3;">"route add -net $dst gw $gw"</span>;<span style="color: #a1db00;">fi</span>;<span style="color: #a1db00;">done</span>;)

        <span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">save IP of this interface</span>
        <span style="color: #ff8700;">myIp</span>=$(getIpAddr $<span style="color: #ff8700;">IFINDEX</span>)


        brctl addbr $<span style="color: #ff8700;">BRIDGE</span>
        ip addr flush dev $<span style="color: #ff8700;">IFINDEX</span>
        brctl addif $<span style="color: #ff8700;">BRIDGE</span> $<span style="color: #ff8700;">IFINDEX</span>

        <span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">restore IP of the old interface to new one</span>
        ifconfig $<span style="color: #ff8700;">BRIDGE</span> $<span style="color: #ff8700;">myIp</span>

        <span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">restore route table related to this interface</span>
        <span style="color: #a1db00;">for </span><span style="color: #d18aff;">r</span><span style="color: #a1db00;"> in</span> <span style="color: #ff4ea3;">"$myRoute"</span>;<span style="color: #a1db00;">do</span>
            $<span style="color: #ff8700;">r</span>
        <span style="color: #a1db00;">done</span>

    }

    getIpAddr(){
        ip addr show $<span style="color: #ff8700;">1</span>|grep -o <span style="color: #ff4ea3;">"inet [^[:space:]]*"</span>|cut -d<span style="color: #ff4ea3;">\ </span> -f2
    }


    moveHostIntf $<span style="color: #ff8700;">1</span>

</pre>
</div>

<p>
最后配置docker使用名为 <code>bridge-&lt;interface-name&gt;</code> 网桥，需要先停止
docker服务：
</p>
<div class="org-src-container">
<pre class="src src-sh">    sudo service docker stop
</pre>
</div>

<p>
修改docker配置文件 <code>/etc/default/docker</code> ，加入这句：
</p>
<pre class="example">
    DOCKER_OPTS="-b=bridge-eth0"
</pre>

<p>
最后该文件可能看起来像这样：
</p>
<pre class="example">
    # Here in Debian, this file is sourced by:
    #   - /etc/init.d/docker (sysvinit)
    #   - /etc/init/docker (upstart)
    #   - systemd's docker.service

    # Use of this file for configuring your Docker daemon is discouraged.

    # The recommended alternative is "/etc/docker/daemon.json", as described in:
    #   https://docs.docker.com/v1.11/engine/reference/commandline/daemon/#daemon-configuration-file

    # If that does not suit your needs, try a systemd drop-in file, as described in:
    #   https://docs.docker.com/v1.11/engine/admin/systemd/#custom-docker-daemon-options
    DOCKER_OPTS="-b=bridge-eth0"
</pre>

<p>
这样拉起的容器，就可以分到10网段的ip地址。它们也就暴露在外部网络中了。
</p>

<p>
这样再拉起ras容器后，可以直接通过ip来访问了。比如这里两个容器就可以
分别用 <code>http://10.10.10.2:80</code> 和 <code>http://10.10.10.3:80</code> 访问对应容器
的端口。
</p>
</div>
</div>

<div id="outline-container-orge3f5a3b" class="outline-2">
<h2 id="orge3f5a3b"><span class="section-number-2">3</span> <span class="todo TODO">TODO</span> Mac上使用</h2>
<div class="outline-text-2" id="text-3">
<p>
由于Mac上的一些限制（没有网桥这个概念，host不通ping通容器），目前Mac
上拉起vm后，只能通过端口映射的方式访问拉起的vm :(
</p>
<div class="org-src-container">
<pre class="src src-sh">     docker run -d -p 20145:20145 -p 20146:20146 -p 20147:20147 -p 20148:20148 -p 20149:20149 -p 20150:20150 -p 20151:20151 -p 20152:20152 -p 20153:20153 -p 20154:20154 -p 20155:20155 -p 20156:20156 -p 20157:20157 -p 20158:20158 -p 20159:20159 -p 20160:20160 xxx:2.2.4
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Peng Xie</p>
<p class="date">Created: 2018-10-01 Mon 21:36</p>
<p class="validation"></p>
</div>
</body>
</html>